"""Есть 2 списка.
а = [1,2,3,4,5,6,7]
b = [5,3,4,12,3,56,8]

Вывести только общие элементы из этих 2 списков."""
a = [1, 2, 3, 4, 5, 6, 7]
b = [5, 3, 4, 12, 3, 56, 8]
c = set(a).intersection(set(b))
print(c)
